[
  {
    "project_id": "about_me",
    "project_name": "Yaqout Khalaf",
    "short_description": "Computer Engineering Student passionate about AI, Web Development, and Robotics.",
    "long_description": "Hi! I'm Yaqout Khalaf, a motivated engineering student with a love for solving problems using code. I have experience in JavaScript, Python, C++, and love building interactive web experiences and smart systems. This is a portfolio showcasing some of my recent work.",
    "card_image": "./starter/img/yaqout.jpg",
    "external_link": "#",
    "bio": "Yaqout Khalaf is a creative problem solver with a passion for technology, web development, and artificial intelligence. Currently studying Computer Engineering.",
    "headshot": "./starter/img/yaqout.jpg"
  },
  {
    "project_id": "sliding_game",
    "project_name": "Sliding Man & Monsters",
    "short_description": "AI-based game using Q-Learning and Heuristics.",
    "long_description": "An interactive game where the player (sliding man) navigates a grid avoiding monsters. Built using C++ with Q-Learning for decision-making. Includes dynamic environment and state rewards.",
    "card_image": "./starter/img/sliding_game.jpg",
    "external_link": "https://github.com/yaqout/sliding-man-monsters"
  },
  {
    "project_id": "portfolio_page",
    "project_name": "Personal Portfolio Website",
    "short_description": "Responsive portfolio built with HTML, CSS, and JavaScript.",
    "long_description": "This is the very website you are looking at! Built using vanilla HTML, CSS, and JavaScript with dynamic loading from JSON. Includes About Me, Projects, and Contact sections.",
    "card_image": "./starter/img/portfolio.jpg",
    "external_link": "https://yaqout.dev"
  },
  {
    "project_id": "ros_turtlebot",
    "project_name": "ROS TurtleSim Robot",
    "short_description": "Autonomous navigation using ROS.",
    "long_description": "Implemented an autonomous system using ROS and turtlesim in Python. The turtle moves while avoiding screen boundaries, simulating simple obstacle-aware behavior.",
    "card_image": "./starter/img/turtle.jpg",
    "external_link": "https://github.com/yaqout/ros-turtlesim"
  }
]
